<?php

defined('BASEPATH') or exit('No direct script access allowed');

/*
|--------------------------------------------------------------------------
| Base Site URL   基本站点网址 URL
|--------------------------------------------------------------------------
|
| CodeIgniter 根目录的 URL。
| 通常这将是您的基本 URL，带有尾部斜杠：
|
|	http://example.com/
|
| 警告：您必须设置此值！
|
| 如果未设置，那么 CodeIgniter 将尝试猜测协议和安装路径，
| 但出于安全考虑，
| 主机名将设置为 $_SERVER['SERVER_ADDR']（如果可用），否则设置为 localhost。
| 自动检测机制的存在只是为了开发过程中的方便，
| 不得在生产中使用！
|
| 如果您需要允许多个域，请记住该文件仍然是一个 PHP 脚本，
| 您可以轻松地自行完成。
|
*/
$protocol           = is_https() ? 'https://' : 'http://';
$config['base_url'] = $protocol . $_SERVER['HTTP_HOST'] . '/';

/*
|--------------------------------------------------------------------------
| Index File   索引文件
|--------------------------------------------------------------------------
|
| 通常这将是您的 index.php 文件，
| 除非您已将其重命名为其他内容。
| 如果您使用 mod_rewrite 删除页面，请将此变量设置为空白。
|
*/
$config['index_page'] = '';

/*
|--------------------------------------------------------------------------
| URI PROTOCOL   URI协议
|--------------------------------------------------------------------------
|
| 此项确定应使用哪个服务器全局来检索URI字符串。
| 默认设置"REQUEST_URI"适用于大多数服务器。
| 如果您的链接似乎不起作用，请尝试其中一种其他美味：
|
| 'REQUEST_URI'    Uses $_SERVER['REQUEST_URI']
| 'QUERY_STRING'   Uses $_SERVER['QUERY_STRING']
| 'PATH_INFO'      Uses $_SERVER['PATH_INFO']
|
| 警告:如果您将其设置为'PATH_INFO'，URIs将始终是URL解码的!
*/
$config['uri_protocol'] = 'REQUEST_URI';

/*
|--------------------------------------------------------------------------
| URL suffix   网址后缀
|--------------------------------------------------------------------------
|
| 该选项允许您为 CodeIgniter 生成的所有 URL 添加后缀。
| 有关更多信息，请参阅用户指南：
|
| https://codeigniter.com/user_guide/general/urls.html
*/
$config['url_suffix'] = '';

/*
|--------------------------------------------------------------------------
| Default Language   默认语言
|--------------------------------------------------------------------------
|
| 这决定了应该使用哪一组语言文件。
| 如果您打算使用英语以外的内容，
| 请确保有可用的翻译。
|
*/
$config['language'] = '%LANGUAGE%';

/*
|--------------------------------------------------------------------------
| Default Character Set   默认字符集
|--------------------------------------------------------------------------
|
| 这决定了在需要提供字符集的各种方法中
| 默认使用哪个字符集。
|
| 有关支持的字符集列表，请参阅 http://php.net/htmlspecialchars
|
*/
$config['charset'] = 'UTF-8';

/*
|--------------------------------------------------------------------------
| Enable/Disable System Hooks 启用/禁用系统Hooks
|--------------------------------------------------------------------------
|
| 如果您想使用"hooks"功能，您必须通过将此变量设置为TRUE（boolean布尔值）来启用它。
| 有关详细信息，请参阅用户指南。
|
*/
$config['enable_hooks'] = true;

/*
|--------------------------------------------------------------------------
| Class Extension Prefix   类扩展前缀
|--------------------------------------------------------------------------
|
| 此项允许您在扩展本地库时设置文件名/类名前缀。  
| 有关详细信息，请参阅用户指南：
|
| https://codeigniter.com/user_guide/general/core_classes.html
| https://codeigniter.com/user_guide/general/creating_libraries.html
|
*/
$config['subclass_prefix'] = 'MY_';

/*
|--------------------------------------------------------------------------
| Composer auto-loading   Composer自动加载
|--------------------------------------------------------------------------
|
| 启用此设置将告诉 CodeIgniter 
| 在 application/vendor/autoload.php 中查找 Composer 包自动加载脚本。
|
|	$config['composer_autoload'] = TRUE;
|
| 或者，如果您的 vendor/ 目录位于其他位置，
| 您也可以选择设置特定路径：
|
|	$config['composer_autoload'] = '/path/to/vendor/autoload.php';
|
| 有关 Composer 的更多信息，请访问 http://getcomposer.org/
|
| 注意：这不会禁用或覆盖 CodeIgniter 特定的
|      自动加载 (application/config/autoload.php)
*/
$config['composer_autoload'] = FCPATH . 'vendor/autoload.php';

/*
|--------------------------------------------------------------------------
| Allowed URL Characters   允许的 URL 字符
|--------------------------------------------------------------------------
|
| 这使您可以指定在您的 URL 中允许使用哪些字符。
| 当有人试图提交包含不允许字符的 URL 时，
| 他们将收到一条警告消息。
|
| 作为一项安全措施，我们强烈建议您将 URL 限制为尽可能少的字符。
| 默认情况下只允许这些： a-z 0-9~%.:_-
|
| 留空以允许所有字符——但前提是你疯了。
|
| 配置的值实际上是一个正则表达式字符组，
| 它将被执行为： ! preg_match('/^[<permitted_uri_chars>]+$/i
|
| 除非您完全理解后果，否则请勿更改！
|
*/
$config['permitted_uri_chars'] = '‘a-z 0-9~%.:\_\=+%\&-';

/*
|--------------------------------------------------------------------------
| Enable Query Strings   启用查询字符串
|--------------------------------------------------------------------------
|
| 默认情况下，CodeIgniter 使用基于搜索引擎友好段的 URL：
| example.com/who/what/where/
|
| 您可以选择启用基于标准查询字符串的 URL：
| example.com?who=me&what=something&where=here
|
| 选项有: TRUE 或 FALSE (boolean布尔值)
|
| 其他项目允许您设置将调用您的控制器及其功能的
| 查询字符串“words”：
| example.com/index.php?c=controller&m=function
|
| 请注意，
| 当此功能启用时，一些助手将无法按预期工作，
| 因为 CodeIgniter 主要设计用于使用基于段的 URL。
|
*/
$config['enable_query_strings'] = false;
$config['controller_trigger']   = 'c';
$config['function_trigger']     = 'm';
$config['directory_trigger']    = 'd';

/*
|--------------------------------------------------------------------------
| Allow $_GET array   允许 $_GET 数组
|--------------------------------------------------------------------------
|
| 默认情况下，CodeIgniter 允许访问 $_GET 数组。
| 如果出于某种原因您想禁用它，请将“allow_get_array”设置为 FALSE。
|
| 警告：此功能已弃用，目前仅可用于
| 向后兼容目的！
|
*/
$config['allow_get_array'] = true;

/*
|--------------------------------------------------------------------------
| Error Logging Threshold   错误记录阈值
|--------------------------------------------------------------------------
|
| 您可以通过将阈值设置为大于零来启用错误日志记录。
| 阈值决定了记录的内容。 阈值选项是：
|
|      0 = 禁用日志记录，错误日志记录关闭
|      1 = 错误消息（包括 PHP 错误）
|      2 = 调试消息
|      3 = 信息性消息
|      4 = 所有消息
|
| 您还可以传递具有阈值级别的数组以显示各个错误类型
|
| 	array(2) = 调试消息，没有错误消息
|
| 对于实时站点，您通常只会启用要记录的错误 (1)，否则
| 您的日志文件会很快填满。
|
*/
$config['log_threshold'] = 0;

/*
|--------------------------------------------------------------------------
| Error Logging Directory Path   错误记录目录路径
|--------------------------------------------------------------------------
|
| 除非您想设置默认的 application/logs/ 目录以外的内容，否则请保留此空白。
| 使用带有尾部斜杠的完整服务器路径。
|
*/
$config['log_path'] = '';

/*
|--------------------------------------------------------------------------
| Log File Extension   日志文件扩展名
|--------------------------------------------------------------------------
|
| 日志文件的默认文件扩展名。
| 当日志文件存储在可公开访问的目录下时，
| 默认的“php”允许通过基本脚本保护日志文件。
|
| 注意：将其留空将默认为“php”。
|
*/
$config['log_file_extension'] = '';

/*
|--------------------------------------------------------------------------
| Log File Permissions   日志文件权限
|--------------------------------------------------------------------------
|
| 要应用于新创建的日志文件的文件系统权限。
|
| 重要提示：这必须是一个整数（无引号）并且您必须使用
|         八进制整数表示法（即 0700、0644 等）
*/
$config['log_file_permissions'] = 0644;

/*
|--------------------------------------------------------------------------
| Date Format for Logs 日志的日期格式
|--------------------------------------------------------------------------
|
| 记录的每个项目都有一个关联的日期。
| 您可以使用 PHP 日期代码来设置您自己的日期格式
|
*/
$config['log_date_format'] = 'Y-m-d H:i:s';

/*
|--------------------------------------------------------------------------
| Error Views Directory Path 错误视图目录路径
|--------------------------------------------------------------------------
|
| 除非您想设置默认的 application/views/errors/ 目录以外的内容，否则请保留此空白。
| 使用带有尾部斜杠的完整服务器路径。
|
*/
$config['error_views_path'] = '';

/*
|--------------------------------------------------------------------------
| Cache Directory Path   缓存目录路径
|--------------------------------------------------------------------------
|
| 除非您想设置默认的 application/cache/ 目录以外的内容，否则请保留此空白。
| 使用带有尾部斜杠的完整服务器路径。
|
*/
$config['cache_path'] = '';

/*
|--------------------------------------------------------------------------
| Cache Include Query String 缓存包含查询字符串
|--------------------------------------------------------------------------
|
| 生成输出缓存文件时是否考虑 URL 查询字符串。 
| 有效选项是：
|
|	FALSE      = Disabled(禁用)
|	TRUE       = Enabled(启用)，考虑所有查询参数。
|                    请注意，这可能会导致为同一页面一遍
|                    又一遍地生成大量缓存文件。
|	array('q') = Enabled, 但只考虑指定列表的
|                    查询参数。
|
*/
$config['cache_query_string'] = false;

/*
|--------------------------------------------------------------------------
| Encryption Key 加密密钥
|--------------------------------------------------------------------------
|
| 如果使用加密类，则必须设置加密密钥。
| 有关详细信息，请参阅用户指南。
|
| https://codeigniter.com/user_guide/libraries/encryption.html
|
*/
$config['encryption_key'] = '';

/*
|--------------------------------------------------------------------------
| Session Variables   会话变量
|--------------------------------------------------------------------------
|
| 'sess_driver'
|
| 使用的存储驱动：文件、数据库、redis、memcached
|
| 'sess_cookie_name'
|
| 会话 cookie 名称，只能包含 [0-9a-z_-] 个字符
|
| 'sess_expiration'
|
| 您希望会话持续的秒数。
| 设置为 0（零）表示在浏览器关闭时过期。
|
| 'sess_save_path'
|
| 保存会话的位置，取决于驱动程序。
|
| 对于“文件”驱动程序，它是一个可写目录的路径。
| 警告：仅支持绝对路径！
|
| 对于“数据库”驱动程序，它是一个表名。
| 请阅读手册以了解其他会话驱动程序的格式。
|
| 重要提示：您需要设置有效的保存路径！
|
| 'sess_match_ip'
|
| 读取session数据时是否匹配用户IP地址。
|
| 警告：如果您使用的是数据库驱动程序，请不要忘记更新
| 更改此设置时会话表的主键 PRIMARY KEY。
|
| 'sess_time_to_update'
|
| CI 重新生成会话 ID 之间的秒数。
|
| 'sess_regenerate_destroy'
|
| 是否销毁与旧会话 ID 关联的会话数据
| 自动重新生成会话 ID 时。 当设置为 FALSE 时，数据
| 稍后将被垃圾收集器删除。
|
| 其他会话 cookie 设置与应用程序的其余部分共享，
|
|
*/
$config['sess_driver']             = 'files';
$config['sess_cookie_name']        = 'yesilcms_sess';
$config['sess_expiration']         = 7200;
$config['sess_save_path']          = null;
$config['sess_match_ip']           = false;
$config['sess_time_to_update']     = 300;
$config['sess_regenerate_destroy'] = false;

/*
|--------------------------------------------------------------------------
| Cookie Related Variables Cookie相关变量
|--------------------------------------------------------------------------
|
| 'cookie_prefix'   = 如果需要避免冲突，请设置 cookie 名称前缀
| 'cookie_domain'   = 为站点范围的 cookie 设置为 .your-domain.com
| 'cookie_path'     = 通常是正斜杠
| 'cookie_secure'   = 仅当存在安全 HTTPS 连接时才会设置 Cookie。
| 'cookie_httponly' = Cookie 只能通过 HTTP(S) 访问（无 javascript）
|
| 注意：这些设置（“cookie_prefix”和
| 'cookie_httponly') 也会影响会话。
|
*/
$config['cookie_prefix']   = '';
$config['cookie_domain']   = '';
$config['cookie_path']     = '/';
$config['cookie_secure']   = '%COOKIE%';
$config['cookie_httponly'] = false;

/*
|--------------------------------------------------------------------------
| Standardize newlines   标准化换行符
|--------------------------------------------------------------------------
|
| 确定是否标准化输入数据中的换行符，
| 意思是用 PHP_EOL 值替换出现的 \r\n、\r、\n。
|
| 警告：此功能已弃用，目前仅可用
| 出于向后兼容的目的！
|
*/
$config['standardize_newlines'] = false;

/*
|--------------------------------------------------------------------------
| Global XSS Filtering   全局 XSS 过滤
|--------------------------------------------------------------------------
|
| 确定 XSS 过滤器在 GET、POST 或
| 遇到 COOKIE 数据
|
| 警告：此功能已弃用，目前仅可用
| 出于向后兼容的目的！
|
*/
$config['global_xss_filtering'] = true;

/*
|--------------------------------------------------------------------------
| Cross Site Request Forgery   跨站请求伪造
|--------------------------------------------------------------------------
| 允许设置 CSRF cookie 令牌。 当设置为 TRUE 时，令牌将
| 检查提交的表格。 如果您接受用户数据，则强烈
| 建议启用 CSRF 保护。
|
| 'csrf_token_name'   = 令牌名称
| 'csrf_cookie_name'  = cookie 名称
| 'csrf_expire'       = 令牌应过期的秒数。
| 'csrf_regenerate'   = 每次提交时重新生成令牌
| 'csrf_exclude_uris' = 忽略 CSRF 检查的 URI 数组
*/
$config['csrf_protection']   = true;
$config['csrf_token_name']   = 'csrf_yesilcms_token';
$config['csrf_cookie_name']  = 'csrf_yesilcms_cookie';
$config['csrf_expire']       = 7200;
$config['csrf_regenerate']   = true;
$config['csrf_exclude_uris'] = array();

/*
|--------------------------------------------------------------------------
| Output Compression   输出压缩
|--------------------------------------------------------------------------
|
| 启用 Gzip 输出压缩以加快页面加载速度。 启用时，
| 输出类将测试您的服务器是否支持 Gzip。
| 然而，即使支持，也并非所有浏览器都支持压缩
| 因此，仅当您有理由确定您的访问者可以处理它时才启用。
|
| 仅在您的 php.ini 中关闭 zlib.output_compression 时使用。
| 请不要将它与 httpd 级别的输出压缩一起使用。
|
| 非常重要：如果启用压缩后出现空白页，则
| 意味着你过早地输出一些东西到你的浏览器。 它可以
| 甚至是您的一个脚本末尾的一行空格。 为了
| 压缩工作，在调用输出缓冲区之前不能发送任何内容
| 由输出类。 不要在启用压缩的情况下“回显”任何值。
|
*/
$config['compress_output'] = false;

/*
|--------------------------------------------------------------------------
| Master Time Reference   主时间参考
|--------------------------------------------------------------------------
|
| 选项是"local"本地”或任何 PHP 支持的时区。 这个偏好告诉
| 系统是否使用你服务器的本地时间作为“现在”的主
| 参考，或将其转换为配置的一个时区。 见日期
| 用户指南的帮助页面，了解有关日期处理的信息。
|
$config['time_reference'] = 'local';
*/

/*
|--------------------------------------------------------------------------
| Rewrite PHP Short Tags   重写 PHP 短标签
|--------------------------------------------------------------------------
|
| 如果您的 PHP 安装没有启用短标签支持 CI
| 可以即时重写标签，使您能够利用该语法
| 在您的视图文件中。 选项为 TRUE 或 FALSE（布尔值）
|
| 注意：您需要启用 eval() 才能使其工作。
|
*/
$config['rewrite_short_tags'] = false;

/*
|--------------------------------------------------------------------------
| Reverse Proxy IPs   反向IP代理
|--------------------------------------------------------------------------
|
| 如果您的服务器位于反向代理之后，您必须将代理列入白名单
| CodeIgniter 应该信任来自的 IP 地址，例如
| HTTP_X_FORWARDED_FOR 和 HTTP_CLIENT_IP 以便正确识别
| 访问者的 IP 地址。
|
| 您可以使用数组或逗号分隔的代理地址列表，
| 以及指定整个子网。 这里有一些例子：
|
| 逗号分隔：'10.0.1.200,192.168.5.0/24'
| 数组：array('10.0.1.200', '192.168.5.0/24')
*/
$config['proxy_ips'] = '';
